app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 3]]
---
<p>
  <h4><%= @article.comments.count %> Comments</h4>