app/views/welcome/index.html.erb

      <div class="row">
        <% Article.last_ten.each do |f| %>
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."created_at" ASC LIMIT $1  [["LIMIT", 10]]