app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" ASC
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "headline", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save