app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "content", "created_at", "updated_at", "article_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "sofi"], ["content", "hola"], ["created_at", 2017-03-14 19:24:45 UTC], ["updated_at", 2017-03-14 19:24:45 UTC], ["article_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article = Article.find(params.require(:comment).permit(:article)['article'])
    @comment.article_id = @comment.article.id

    respond_to do |format|
      if @comment.save